docs/inclass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-12 Mon 19:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>SWE 619 In Class Exercises</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercises</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdfcc50f">In Class Exercises</a>
<ul>
<li><a href="#ic0">In class 0</a></li>
<li><a href="#ic1A">In class 1A</a></li>
<li><a href="#ic1B">In class 1B</a></li>
<li><a href="#ic2A">In class 2A</a></li>
<li><a href="#ic2B">In class 2B</a></li>
<li><a href="#ic3A">In class 3A</a></li>
<li><a href="#ic3B">In class 3B</a></li>
<li><a href="#ic4A">In class 4A</a></li>
<li><a href="#ic4B">In class 4B</a></li>
<li><a href="#ic5A">In class 5A</a></li>
<li><a href="#ic5B">In class 5B</a></li>
<li><a href="#ic5C">In class 5C</a></li>
<li><a href="#ic6">In class 6</a></li>
<li><a href="#ic8A">In class 8A</a></li>
<li><a href="#ic8B">In class 8B</a></li>
<li><a href="#ic8C">In class 8C</a></li>
<li><a href="#ic9A">In class 9A</a></li>
<li><a href="#ic9B">In class 9B</a></li>
<li><a href="#ic10A">In class 10A</a></li>
<li><a href="#ic10B">In class 10B</a></li>
<li><a href="#ic10C">In class 10C</a></li>
<li><a href="#ic11">In class 11</a></li>
<li><a href="#ic12A">In class 12A</a></li>
<li><a href="#ic12B">In class 12B</a></li>
<li><a href="#ic13">In class 13</a></li>
</ul>
</li>
<li><a href="#org5775edf">Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdfcc50f" class="outline-2">
<h2 id="orgdfcc50f">In Class Exercises</h2>
<div class="outline-text-2" id="text-orgdfcc50f">
</div>
<div id="outline-container-ic0" class="outline-3">
<h3 id="ic0">In class 0</h3>
<div class="outline-text-3" id="text-ic0">
<p>
Work with your group. Your group assignment is on Piazza. (You might decide to change groups later, but for today, stick with this group.) When we invoke the BB break-out function, nagivate to your assigned group.
</p>

<ol class="org-ol">
<li>Your group should spend a few minutes getting acquainted. Explain a bit about yourself: full-time student?, working in  software development?, why are you taking this class?, favorite/least favorite thing about writing software?, etc.</li>
<li>Decide on a mechanism for joint communication. Google docs? IDE with screen share? Something else?</li>
</ol>

<p>
Now address a technical topic. This exercise touches on some of the thorny issues in data abstraction and inheritance. There is a lot going on in this example. Hence don't worry if it seems confusing today. We'll revisit this example several times over the course of the semester.
</p>

<p>
Consider the following (textbook) code:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">User</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">User</span> (<span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>) { <span style="color: #859900; font-weight: bold;">this</span>.name = name; }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> User)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;
        <span style="color: #859900; font-weight: bold;">return</span> ((<span style="color: #b58900; font-style: italic;">User</span>) obj).name.equals(<span style="color: #859900; font-weight: bold;">this</span>.name);
    }
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">other methods omitted</span>
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">SpecialUser</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">User</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">id</span>;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">SpecialUser</span> (<span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>, <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">id</span>) { <span style="color: #859900; font-weight: bold;">super</span>(name); <span style="color: #859900; font-weight: bold;">this</span>.id = id; }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> SpecialUser)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.equals(obj) &amp;&amp; ((<span style="color: #b58900; font-style: italic;">SpecialUser</span>) obj).id == <span style="color: #859900; font-weight: bold;">this</span>.id;
    }
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">other methods omitted</span>
}
</pre>
</div>

<ol class="org-ol">
<li>Walk though the execution of the <code>equals()</code> method in class <code>User</code> for a few well-chosen objects as the parameter. What happens at each point in the execution?</li>
<li>What does it mean for an <code>equals()</code> implementation to be <b>correct</b>? How do you know? Be as concrete as you can.</li>
<li>Is the given implementation of <code>equals()</code> in class <code>User</code> correct? Again, be concrete. If there is a problem, find a specific object (test case!) that demonstrates the problem.</li>
<li>How does inheritance complicate the correctness discussion for <code>equals()</code> in class <code>SpecialUser</code>?</li>
<li>What is your assessment of the <code>equals()</code> method in the <code>SpecialUser</code> class?</li>
</ol>
</div>
</div>

<div id="outline-container-ic1A" class="outline-3">
<h3 id="ic1A">In class 1A</h3>
<div class="outline-text-3" id="text-ic1A">
<p>
Consider the following specification and implementation:
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #b58900;">tail</span> (<span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">list</span>) {

    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">REQUIRES: ???</span>
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">EFFECTS:  ???</span>

    <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">result</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt;(list);
    result.remove(0);
    <span style="color: #859900; font-weight: bold;">return</span> result;
}
</pre>
</div>

<ol class="org-ol">
<li>What does the <b>implementation</b> of <code>tail</code> do in each of the following cases? How do you know: Running the code or reading an API description?
<ul class="org-ul">
<li><code>list = null</code></li>
<li><code>list = []</code></li>
<li><code>list = [1]</code></li>
<li><code>list = [1, 2, 3]</code></li>
</ul></li>
<li>Write a partial specification that matches the "happy path" part of the implementation's behavior.</li>
<li>Rewrite the specification to be total. Use Bloch's standard exceptions.</li>
<li>The resulting specification has a problem. What is it?</li>
<li>Rewrite the specification to address this problem. Rewrite the code to match the new specification.</li>
</ol>
</div>
</div>

<div id="outline-container-ic1B" class="outline-3">
<h3 id="ic1B">In class 1B</h3>
<div class="outline-text-3" id="text-ic1B">
<p>
<b>Goal</b>: Understanding Contracts 
</p>

<p>
Consider the Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/Iterator.html">Iterator</a> interface.
</p>
<ul class="org-ul">
<li>For each method, identify all preconditions and postconditions.</li>
<li>For each precondition, identify a specific input that violates the precondition.</li>
<li>For each postcondition, identify an input specific to that postcondition.</li>
</ul>
</div>
</div>
