docs/inclass.org
* In class 2A
  :PROPERTIES:
  :CUSTOM_ID: ic2A
  :END:
   
  Consider a simple generic =Queue= implementation.
  #+begin_src java

     public class Queue <E> {

         private List<E> elements;
         private int size;

         public Queue() {   
             this.elements = new ArrayList<E>();
             this.size = 0;
         }

         public void enQueue (E e) {
             elements.add(e);
             size++;
         }

         public E deQueue () {
             if (size == 0) throw new IllegalStateException("Queue.deQueue");
             E result = elements.get(0);
             elements.remove(0);
             size--;
             return result;
         }

         public boolean isEmpty() {
             return size == 0;
         }
     }

  #+end_src

  1. Rewrite =Queue= to be *immutable*. Keep the representation variables =elements= and =size=.
  1. Do the right thing with =enQueue()=.
  1. Do the right thing with =deQueue()=.



* In class 2B
  :PROPERTIES:
  :CUSTOM_ID: ic2B
  :END:
   
  
  Consider Liskov's Poly example, where an abstract Poly is defined as $c_0 + c_1x + c_2x^2 + \dots$, and is implemented with two variables:
  #+begin_src java
     private int deg;
     private int[] trms;
  #+end_src

  #+begin_src text
     Fill in example values that are mapped by the abstraction function.
     Abstract Poly State:


     What is a "state"?
     A "state" is an assigment of values to variables


     AF
     /|\
      |         5 + 3x^2
      |
      |
      |----------------------------------------------------------
      |
      |
      |
      |        (-10, null)

     (2, [5,0,3,0])  Liskov says "no"

     (2, [5,0,3])  Liskov says "yes"


     The "rep-invariant" describes which rep states are "yes"
     1) trms != null
     2) deg >= 0
     3) deg = trms.length - 1
     4) and more - see Liskov

     The rep-invariant defines the domain of the abstraction function



     Representation State: (deg, trms)
  #+end_src
  
  1. Identify representation states that should not be mapped.
  1. Try to capture these states with a rule (that is, a rep-invariant).
  1. Devise a representation that is suitable for a mutable version of Poly.
  1. Develop a rep-invariant for that representation.

* In class 3A
  :PROPERTIES:
  :CUSTOM_ID: ic3A
  :END:


  Consider Liskov's immutable =Poly= example, where an abstract =Poly= is defined as $c_0 + c_1x + c_2x^2 + \dots$, and is implemented with one variable:

  #+begin_src java
     private Map<Integer, Integer> map;
  #+end_src
   

  Fill in example values that are mapped by the abstraction function.

  #+begin_src text

     Abstract State: Poly

     AF
     /|\
     |
     |
     |
     |----------------------------------------------------------
     |
     |
     |
     |



     Representation State: map

  #+end_src

  1. Identify representation states that should not be mapped.
  1. Try to capture these states with a rule (that is, a rep-invariant).
  1. Consider implementing the =degree()= method. What code would do the job? What more specific type of map would make the implementation simpler? 

* In class 3B
  :PROPERTIES:
  :CUSTOM_ID: ic3B
  :END:

  Consider the code:

  #+begin_src java

     public class Members {
         // Members is a mutable record of organization membership
         // AF: Collect the list as a set
         // rep-inv1: members != null
         // rep-inv2: members != null && no duplicates in members
         // for simplicity, assume null can be a member...

         List<Person> members;   // the representation

         //  Post: person becomes a member
         public void join (Person person) { members.add   (person);}

         //  Post: person is no longer a member
         public void leave(Person person) { members.remove(person);}

  #+end_src


  1. Analyze these 4 questions for rep-inv 1.
     1. Does =join()= maintain rep-inv?
     1. Does =join()= satisfy contract?
     1. Does =leave()= maintain rep-inv?
     1. Does =leave()= satisfy contract? 
  1. Repeat for rep-inv 2.
  1. Recode =join()= to make the verification go through. Which rep-invariant do you use?
  1. Recode =leave()= to make the verification go through. Which rep-invariant do you use? 

