docs/inclass.html

<div id="outline-container-ic2A" class="outline-3">
<h3 id="ic2A">In class 2A</h3>
<div class="outline-text-3" id="text-ic2A">
<p>
Consider a simple generic <code>Queue</code> implementation.
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Queue</span> &lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; {

    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">elements</span>;
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span>;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Queue</span>() {   
        <span style="color: #859900; font-weight: bold;">this</span>.elements = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt;();
        <span style="color: #859900; font-weight: bold;">this</span>.size = 0;
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">enQueue</span> (<span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">e</span>) {
        elements.add(e);
        size++;
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">E</span> <span style="color: #b58900;">deQueue</span> () {
        <span style="color: #859900; font-weight: bold;">if</span> (size == 0) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IllegalStateException</span>(<span style="color: #2aa198;">"Queue.deQueue"</span>);
        <span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">result</span> = elements.get(0);
        elements.remove(0);
        size--;
        <span style="color: #859900; font-weight: bold;">return</span> result;
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isEmpty</span>() {
        <span style="color: #859900; font-weight: bold;">return</span> size == 0;
    }
}

</pre>
</div>

<ol class="org-ol">
<li>Rewrite <code>Queue</code> to be <b>immutable</b>. Keep the representation variables <code>elements</code> and <code>size</code>.</li>
<li>Do the right thing with <code>enQueue()</code>.</li>
<li>Do the right thing with <code>deQueue()</code>.</li>
</ol>
</div>
</div>



<div id="outline-container-ic2B" class="outline-3">
<h3 id="ic2B">In class 2B</h3>
<div class="outline-text-3" id="text-ic2B">
<p>
Consider Liskov's Poly example, where an abstract Poly is defined as \(c_0 + c_1x + c_2x^2 + \dots\), and is implemented with two variables:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">deg</span>;
<span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span>[] <span style="color: #268bd2;">trms</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Fill in example values that are mapped by the abstraction function.
Abstract Poly State:


What is a "state"?
A "state" is an assigment of values to variables


AF
/|\
|         5 + 3x^2
|
|
|----------------------------------------------------------
|
|
|
|        (-10, null)

(2, [5,0,3,0])  Liskov says "no"

(2, [5,0,3])  Liskov says "yes"


The "rep-invariant" describes which rep states are "yes"
1) trms != null
2) deg &gt;= 0
3) deg = trms.length - 1
4) and more - see Liskov

The rep-invariant defines the domain of the abstraction function



Representation State: (deg, trms)
</pre>
</div>

<ol class="org-ol">
<li>Identify representation states that should not be mapped.</li>
<li>Try to capture these states with a rule (that is, a rep-invariant).</li>
<li>Devise a representation that is suitable for a mutable version of Poly.</li>
<li>Develop a rep-invariant for that representation.</li>
</ol>
</div>
</div>

<div id="outline-container-ic3A" class="outline-3">
<h3 id="ic3A">In class 3A</h3>
<div class="outline-text-3" id="text-ic3A">
<p>
Consider Liskov's immutable <code>Poly</code> example, where an abstract <code>Poly</code> is defined as \(c_0 + c_1x + c_2x^2 + \dots\), and is implemented with one variable:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Map</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>, <span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">map</span>;
</pre>
</div>


<p>
Fill in example values that are mapped by the abstraction function.
</p>

<div class="org-src-container">
<pre class="src src-text">
Abstract State: Poly

AF
/|\
|
|
|
|----------------------------------------------------------
|
|
|
|



Representation State: map

</pre>
</div>

<ol class="org-ol">
<li>Identify representation states that should not be mapped.</li>
<li>Try to capture these states with a rule (that is, a rep-invariant).</li>
<li>Consider implementing the <code>degree()</code> method. What code would do the job? What more specific type of map would make the implementation simpler?</li>
</ol>
</div>
</div>

<div id="outline-container-ic3B" class="outline-3">
<h3 id="ic3B">In class 3B</h3>
<div class="outline-text-3" id="text-ic3B">
<p>
Consider the code:
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Members</span> {
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Members is a mutable record of organization membership</span>
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">AF: Collect the list as a set</span>
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">rep-inv1: members != null</span>
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">rep-inv2: members != null &amp;&amp; no duplicates in members</span>
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">for simplicity, assume null can be a member...</span>

    <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Person</span>&gt; <span style="color: #268bd2;">members</span>;   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">the representation</span>

    <span style="color: #96A7A9; font-style: italic;">//  </span><span style="color: #96A7A9; font-style: italic;">Post: person becomes a member</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">join</span> (<span style="color: #b58900; font-style: italic;">Person</span> <span style="color: #268bd2;">person</span>) { members.add   (person);}

    <span style="color: #96A7A9; font-style: italic;">//  </span><span style="color: #96A7A9; font-style: italic;">Post: person is no longer a member</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">leave</span>(<span style="color: #b58900; font-style: italic;">Person</span> <span style="color: #268bd2;">person</span>) { members.remove(person);}

</pre>
</div>


<ol class="org-ol">
<li>Analyze these 4 questions for rep-inv 1.
<ol class="org-ol">
<li>Does <code>join()</code> maintain rep-inv?</li>
<li>Does <code>join()</code> satisfy contract?</li>
<li>Does <code>leave()</code> maintain rep-inv?</li>
<li>Does <code>leave()</code> satisfy contract?</li>
</ol></li>
<li>Repeat for rep-inv 2.</li>
<li>Recode <code>join()</code> to make the verification go through. Which rep-invariant do you use?</li>
<li>Recode <code>leave()</code> to make the verification go through. Which rep-invariant do you use?</li>
</ol>
</div>
</div>
