docs/inclass.org
* In class 4A
  :PROPERTIES:
  :CUSTOM_ID: ic4A
  :END:

  Consider the Java =Iterator<E>= interface:

  #+begin_src java
     public boolean hasNext();
     public E next() throws NoSuchElementException
                            public void remove() throws IllegalStateException
  #+end_src

  1. What is the abstract state of an iterator without the =remove()= method?
  1. Work through an example iterating over a list of strings: =["bat", "cat", "dog"]=
  1. What is the abstract state of an iterator with a =previous()= method?
  1. What is the abstract state of an iterator with the =remove()= method?
  1. Design an immutable version of the iterator.
     1. How is =hasNext()= handled?
     1. How is =next()= handled?
     1. How is =remove()= handled?
  1. Exercise the immutable iterator with some sample client code. 

* In class 4B
  :PROPERTIES:
  :CUSTOM_ID: ic4B
  :END:

  Consider the example in Bloch's Item 50 (3rd Edition):

  #+begin_src java

     // Broken “immutable” time period class
     public final class Period {               // Question 3
         private final Date start;
         private final Date end;

         /**
          ,* @param start the beginning of the period
          ,* @param end the end of the period; must not precede start
          ,* @throws IAE if start is after end
          ,* @throws NPE if start or end null
          ,*/

         public Period (Date start, Date end) {
             if (start.compareTo(end) > 0) throw new IAE();
             this.start = start; this.end = end;  // Question 1
         }
         public Date start() { return start;}    // Question 2
         public Date end()   { return end;}      // Question 2
     }
  #+end_src


  1. Write code that shows the problem the line marked // Question 1.
  1. Write code that shows the problem the lines marked // Question 2.
  1. Suppose that the class declaration were:
     #+begin_src java
       public class Period { // Question 3
     #+end_src
     - Write code that shows the problem.
  1. Bloch fixes the constructor as follows:
     #+begin_src java
       public Period (Date start, Date end) {
           this.start = new Date(start.getTime());  // Defensive copy
           this.end   = new Date(end.getTime());    // Defensive copy

           if (this.start.compareTo(end) > 0) throw new IAE();
     #+end_src
     1. Bloch states that =clone()= would be inappropriate for copying the dates. Write code that shows the problem.
     1. Bloch defers the exception check until the end, which seems to violate normal practice. What's the problem with checking early? 

* In class 5A
  :PROPERTIES:
  :CUSTOM_ID: ic5A
  :END:

  *Goal*: Understanding dynamic dispatching

  Consider Liskov's =MaxIntSet= example with explict =repOk()= calls: (Really, we'd need assertions on these calls...)

  #+begin_src java

     public class IntSet {
         public void insert(int x) {...; repOk();}
         public void remove(int x) {...; repOk();}
         public boolean repOk() {...}
     }
     public class MaxIntSet extends IntSet {
         public void insert(int x) {...; super.insert(x); repOk();}
         public void remove(int x) {super.remove(x); ...; repOk();}
         public boolean repOk() {super.repOk(); ...;}
     }

     MaxIntSet s = {3, 5}; s.remove(5);  // repOk()????
  #+end_src
  
  1. What does the default constructor in =MaxIntSet= do?
  1. What do the ="..."= bits do?
  1. How does the call work out?
  1. What is the abstract state of a =MaxIntSet=? There are two options. What are they, and what are the consequences of each choice? 

