docs/inclass.html

<div id="outline-container-ic4A" class="outline-3">
<h3 id="ic4A">In class 4A</h3>
<div class="outline-text-3" id="text-ic4A">
<p>
Consider the Java <code>Iterator&lt;E&gt;</code> interface:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">hasNext</span>();
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">E</span> <span style="color: #b58900;">next</span>() <span style="color: #859900; font-weight: bold;">throws</span> <span style="color: #b58900; font-style: italic;">NoSuchElementException</span>
                       <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> remove() <span style="color: #859900; font-weight: bold;">throws</span> <span style="color: #b58900; font-style: italic;">IllegalStateException</span>
</pre>
</div>

<ol class="org-ol">
<li>What is the abstract state of an iterator without the <code>remove()</code> method?</li>
<li>Work through an example iterating over a list of strings: <code>["bat", "cat", "dog"]</code></li>
<li>What is the abstract state of an iterator with a <code>previous()</code> method?</li>
<li>What is the abstract state of an iterator with the <code>remove()</code> method?</li>
<li>Design an immutable version of the iterator.
<ol class="org-ol">
<li>How is <code>hasNext()</code> handled?</li>
<li>How is <code>next()</code> handled?</li>
<li>How is <code>remove()</code> handled?</li>
</ol></li>
<li>Exercise the immutable iterator with some sample client code.</li>
</ol>
</div>
</div>

<div id="outline-container-ic4B" class="outline-3">
<h3 id="ic4B">In class 4B</h3>
<div class="outline-text-3" id="text-ic4B">
<p>
Consider the example in Bloch's Item 50 (3rd Edition):
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Broken &#8220;immutable&#8221; time period class</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Period</span> {               <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Question 3</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">start</span>;
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">end</span>;

    <span style="color: #35a69c; font-style: italic;">/**</span>
<span style="color: #35a69c; font-style: italic;">     * </span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">@param</span><span style="color: #35a69c; font-style: italic;"> start the beginning of the period</span>
<span style="color: #35a69c; font-style: italic;">     * </span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">@param</span><span style="color: #35a69c; font-style: italic;"> end the end of the period; must not precede start</span>
<span style="color: #35a69c; font-style: italic;">     * </span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">@throws</span><span style="color: #35a69c; font-style: italic;"> IAE if start is after end</span>
<span style="color: #35a69c; font-style: italic;">     * </span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">@throws</span><span style="color: #35a69c; font-style: italic;"> NPE if start or end null</span>
<span style="color: #35a69c; font-style: italic;">     */</span>

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Period</span> (<span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">start</span>, <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">end</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (start.compareTo(end) &gt; 0) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IAE</span>();
        <span style="color: #859900; font-weight: bold;">this</span>.start = start; <span style="color: #859900; font-weight: bold;">this</span>.end = end;  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Question 1</span>
    }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #b58900;">start</span>() { <span style="color: #859900; font-weight: bold;">return</span> start;}    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Question 2</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #b58900;">end</span>()   { <span style="color: #859900; font-weight: bold;">return</span> end;}      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Question 2</span>
}
</pre>
</div>


<ol class="org-ol">
<li>Write code that shows the problem the line marked // Question 1.</li>
<li>Write code that shows the problem the lines marked // Question 2.</li>
<li><p>
Suppose that the class declaration were:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Period</span> { <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Question 3</span>
</pre>
</div>
<p>
Write code that shows the problem.
</p></li>
<li><p>
Bloch fixes the constructor as follows:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Period</span> (<span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">start</span>, <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">end</span>) {
    <span style="color: #859900; font-weight: bold;">this</span>.start = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Date</span>(start.getTime());  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Defensive copy</span>
    <span style="color: #859900; font-weight: bold;">this</span>.end   = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Date</span>(end.getTime());    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Defensive copy</span>

    <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #859900; font-weight: bold;">this</span>.start.compareTo(end) &gt; 0) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IAE</span>();
</pre>
</div>
<ol class="org-ol">
<li>Bloch states that <code>clone()</code> would be inappropriate for copying the dates. Write code that shows the problem.</li>
<li>Bloch defers the exception check until the end, which seems to violate normal practice. What's the problem with checking early?</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-ic5A" class="outline-3">
<h3 id="ic5A">In class 5A</h3>
<div class="outline-text-3" id="text-ic5A">
<p>
<b>Goal</b>: Understanding dynamic dispatching
</p>

<p>
Consider Liskov's <code>MaxIntSet</code> example with explict <code>repOk()</code> calls: (Really, we'd need assertions on these calls&#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">IntSet</span> {
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">insert</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>) {...; repOk();}
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">remove</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>) {...; repOk();}
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">repOk</span>() {...}
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">MaxIntSet</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">IntSet</span> {
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">insert</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>) {...; <span style="color: #859900; font-weight: bold;">super</span>.insert(x); repOk();}
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">remove</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>) {<span style="color: #859900; font-weight: bold;">super</span>.remove(x); ...; repOk();}
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">repOk</span>() {<span style="color: #859900; font-weight: bold;">super</span>.repOk(); ...;}
}

<span style="color: #b58900; font-style: italic;">MaxIntSet</span> <span style="color: #268bd2;">s</span> = {3, 5}; s.remove(5);  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">repOk()????</span>
</pre>
</div>

<ol class="org-ol">
<li>What does the default constructor in <code>MaxIntSet</code> do?</li>
<li>What do the <code>"..."</code> bits do?</li>
<li>How does the call work out?</li>
<li>What is the abstract state of a <code>MaxIntSet</code>? There are two options. What are they, and what are the consequences of each choice?</li>
</ol>
</div>
</div>
