docs/inclass.org
* In class 5B
  :PROPERTIES:
  :CUSTOM_ID: ic5B
  :END:

  Consider the following:

  #+begin_src java

     class A:
         public void reduce (Reducer x)    
             // Effects: if x is null throw NPE 
             // else if x is not appropriate for this throw IAE
             // else reduce this by x

             class B:
             public void reduce (Reducer x) 
             // Requires: x is not null
             // Effects: if x is not appropriate for this throw IAE
             // else reduce this by x

             class C:
             public void reduce (Reducer x)   
             // Effects: if x is null return (normally) with no change to this
             // else if x is not appropriate for this throw IAE
             // else reduce this by x
  #+end_src

  Analyze the "methods rule" for =reduce()= in each of these cases: Note: Some analysis may not be necessary. If so, indicate that.

  #+begin_src text

     B extends A.
     Precondition Part:
     Postcondition Part:
     -----------------------------------          
     C extends A.
     Precondition Part:
     Postcondition Part:
     -----------------------------------          
     A extends B.
     Precondition Part:
     Postcondition Part:
     -----------------------------------          
     C extends B.
     Precondition Part:
     Postcondition Part:
     -----------------------------------                    
     A extends C.
     Precondition Part:
     Postcondition Part: 
     -----------------------------------          
  #+end_src

* In class 5C
  :PROPERTIES:
  :CUSTOM_ID: ic5C
  :END:

  Consider the following:
  #+begin_src java

     public class Counter{   // Liskov 7.8
         public Counter()     //EFF: Makes this contain 0
             public int get()     //EFF: Returns the value of this
             public void incr()   //MOD: this //EFF: makes this larger
             }
     public class Counter2 extends Counter { // Liskov 7.9
         public Counter2()         //EFF: Makes this contain 0
             public void incr()       // MOD: this //EFF: double this
             }
     public class Counter3 extends Counter {  // Liskov 7.10
         public Counter3(int n)   //EFF: Makes this contain n
             public void incr(int n)  // MOD: this //EFF: if n>0 add n to this
             }
  #+end_src

  1. What role do constructors play in analyzing the Liskov Substitition Principle?
  1. Is there a constraint about negative/zero values for this? How do we know?
  1. What methods are in the =Counter2= API?
  1. Is =Counter2= a valid subtype of Counter?
  1. What methods are in the =Counter3= API?
  1. Is =Counter3= a valid subtype of =Counter=? In particular, does =incr(int n)= have to be consistent with =incr()=? 

