docs/inclass.html

<div id="outline-container-ic5B" class="outline-3">
<h3 id="ic5B">In class 5B</h3>
<div class="outline-text-3" id="text-ic5B">
<p>
Consider the following:
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">A</span>:
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> reduce (<span style="color: #b58900; font-style: italic;">Reducer</span> <span style="color: #268bd2;">x</span>)    
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: if x is null throw NPE </span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">else if x is not appropriate for this throw IAE</span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">else reduce this by x</span>

        <span style="color: #859900; font-weight: bold;">class</span> B:
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> reduce (<span style="color: #b58900; font-style: italic;">Reducer</span> <span style="color: #268bd2;">x</span>) 
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: x is not null</span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: if x is not appropriate for this throw IAE</span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">else reduce this by x</span>

        <span style="color: #859900; font-weight: bold;">class</span> C:
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> reduce (<span style="color: #b58900; font-style: italic;">Reducer</span> <span style="color: #268bd2;">x</span>)   
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: if x is null return (normally) with no change to this</span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">else if x is not appropriate for this throw IAE</span>
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">else reduce this by x</span>
</pre>
</div>

<p>
Analyze the "methods rule" for <code>reduce()</code> in each of these cases: Note: Some analysis may not be necessary. If so, indicate that.
</p>

<div class="org-src-container">
<pre class="src src-text">
B extends A.
Precondition Part:
Postcondition Part:
-----------------------------------          
C extends A.
Precondition Part:
Postcondition Part:
-----------------------------------          
A extends B.
Precondition Part:
Postcondition Part:
-----------------------------------          
C extends B.
Precondition Part:
Postcondition Part:
-----------------------------------                    
A extends C.
Precondition Part:
Postcondition Part: 
-----------------------------------          
</pre>
</div>
</div>
</div>

<div id="outline-container-ic5C" class="outline-3">
<h3 id="ic5C">In class 5C</h3>
<div class="outline-text-3" id="text-ic5C">
<p>
Consider the following:
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Counter</span>{   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Liskov 7.8</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Counter</span>()     <span style="color: #96A7A9; font-style: italic;">//</span><span style="color: #96A7A9; font-style: italic;">EFF: Makes this contain 0</span>
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> get()     <span style="color: #96A7A9; font-style: italic;">//</span><span style="color: #96A7A9; font-style: italic;">EFF: Returns the value of this</span>
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> incr()   <span style="color: #96A7A9; font-style: italic;">//</span><span style="color: #96A7A9; font-style: italic;">MOD: this //EFF: makes this larger</span>
        }
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Counter2</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Counter</span> { <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Liskov 7.9</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Counter2</span>()         <span style="color: #96A7A9; font-style: italic;">//</span><span style="color: #96A7A9; font-style: italic;">EFF: Makes this contain 0</span>
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> incr()       <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">MOD: this //EFF: double this</span>
        }
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Counter3</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Counter</span> {  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Liskov 7.10</span>
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Counter3</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">n</span>)   <span style="color: #96A7A9; font-style: italic;">//</span><span style="color: #96A7A9; font-style: italic;">EFF: Makes this contain n</span>
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> incr(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">n</span>)  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">MOD: this //EFF: if n&gt;0 add n to this</span>
        }
</pre>
</div>

<ol class="org-ol">
<li>What role do constructors play in analyzing the Liskov Substitition Principle?</li>
<li>Is there a constraint about negative/zero values for this? How do we know?</li>
<li>What methods are in the <code>Counter2</code> API?</li>
<li>Is <code>Counter2</code> a valid subtype of Counter?</li>
<li>What methods are in the <code>Counter3</code> API?</li>
<li>Is <code>Counter3</code> a valid subtype of <code>Counter</code>? In particular, does <code>incr(int n)</code> have to be consistent with <code>incr()</code>?</li>
</ol>
</div>
</div>
