docs/inclass.html

<div id="outline-container-ic6" class="outline-3">
<h3 id="ic6">In class 6</h3>
<div class="outline-text-3" id="text-ic6">
<p>
This is a recap exercise.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">BoundedQueue</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">rep</span>[];
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">front</span> = 0;
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">back</span> = -1;
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span> = 0;
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">count</span> = 0;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">BoundedQueue</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (size &gt; 0) {
            <span style="color: #859900; font-weight: bold;">this</span>.size = size;
            rep = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Object</span>[size];
            back = size - 1;
        }  }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isEmpty</span>() { <span style="color: #859900; font-weight: bold;">return</span> (count == 0); }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isFull</span>() { <span style="color: #859900; font-weight: bold;">return</span> (count == size); }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">getCount</span>() { <span style="color: #859900; font-weight: bold;">return</span> count; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">put</span>(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">e</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (e != <span style="color: #6c71c4; font-weight: bold;">null</span> &amp;&amp; <span style="color: #268bd2; font-weight: bold;">!</span>isFull()) {
            back++;
            <span style="color: #859900; font-weight: bold;">if</span> (back &gt;= size)
                back = 0;
            rep[back] = e;
            count++;
        } }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #b58900;">get</span>() {
        <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">result</span> = <span style="color: #6c71c4; font-weight: bold;">null</span>;
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>isEmpty()) {
            result = rep[front];
            rep[front] = <span style="color: #6c71c4; font-weight: bold;">null</span>;
            front++;
            <span style="color: #859900; font-weight: bold;">if</span> (front &gt;= size)
                front = 0;
            count--;
        }
        <span style="color: #859900; font-weight: bold;">return</span> result;
    }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #b58900;">toString</span>() {
        <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">result</span> = <span style="color: #2aa198;">"front = "</span> + front;
        result += <span style="color: #2aa198;">"; back = "</span> + back;
        result += <span style="color: #2aa198;">"; size = "</span> + size;
        result += <span style="color: #2aa198;">"; count = "</span> + count;
        result += <span style="color: #2aa198;">"; rep = ["</span>;
        <span style="color: #859900; font-weight: bold;">for</span> (<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">i</span> = 0; i &lt; rep.<span style="color: #b58900; font-style: italic;">length</span>; i++) {
            <span style="color: #859900; font-weight: bold;">if</span> (i &lt; rep.<span style="color: #b58900; font-style: italic;">length</span>-1)
                result = result + rep[i] + <span style="color: #2aa198;">", "</span>;
            <span style="color: #859900; font-weight: bold;">else</span>
                result = result + rep[i];
        }
        <span style="color: #859900; font-weight: bold;">return</span> result + <span style="color: #2aa198;">"]"</span>;
    }
}

</pre>
</div>


<ol class="org-ol">
<li>How would Liskov describe a typical bounded queue?</li>
<li>What is wrong with <code>toString()</code>? What needs to be done to fix it? Make it so.</li>
<li>Write some sample client code to exercise the data structure. Include some non-happy-path cases. Would Bloch likely change the behavior? If so, how?</li>
<li>Write contracts for each method (as written), including the constructor.</li>
<li>Build a rep-invariant. Focus on the code in <code>get()</code>. There are also lots of constraints on the array indices; these are quite tricky to get right. The constructor also introduces some complexity.</li>
<li><p>
Suppose we removed the line
</p>
<div class="org-src-container">
<pre class="src src-java">rep[front] = <span style="color: #6c71c4; font-weight: bold;">null</span>;       
</pre>
</div>
<p>
from <code>get()</code>.
</p>
<ol class="org-ol">
<li>Informally, why is this wrong?</li>
<li>Formally, where does the correctness proof break down?</li>
<li>Could a client ever see the problem?</li>
</ol></li>
<li>Now that we've done some AF/RI analysis, what changes make the implementation better? btw - this is code straight out of a textbook.</li>
<li>Could this data structure be made immutable? If so, what would change in the contracts and method headers? What would likely change in the implementation?</li>
</ol>
</div>
</div>


<div id="outline-container-ic8A" class="outline-3">
<h3 id="ic8A">In class 8A</h3>
<div class="outline-text-3" id="text-ic8A">
<p>
Given the following variable declarations, independently consider the given 6 sequences of Java instructions.
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #b58900; font-style: italic;">String</span>           <span style="color: #268bd2;">string</span> = <span style="color: #2aa198;">"bat"</span>;
<span style="color: #b58900; font-style: italic;">Integer</span>          <span style="color: #268bd2;">x</span> = 7;
<span style="color: #b58900; font-style: italic;">Object</span>[]         <span style="color: #268bd2;">objects</span>;
<span style="color: #b58900; font-style: italic;">List</span>             <span style="color: #268bd2;">rawList</span>;
<span style="color: #b58900; font-style: italic;">List</span> &lt; <span style="color: #b58900; font-style: italic;">Object</span> &gt;  <span style="color: #268bd2;">objectList</span>;
<span style="color: #b58900; font-style: italic;">List</span> &lt; <span style="color: #b58900; font-style: italic;">String</span> &gt;  <span style="color: #268bd2;">stringList</span>;

</pre>
</div>

<p>
Identify any code that results in a compiler error or warning.
Identify any code that raises a runtime exception.
Once a compiler error is noted, you do not need to analyze the sequence further.
</p>

<ol class="org-ol">
<li><div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">String</span>[1]; 
objects[0] = string;     
objects[0] = x;        
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Object</span>[1];
objects[0] = string;   
objects[0] = x;     
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">stringList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span> &lt; <span style="color: #b58900; font-style: italic;">String</span> &gt;();
stringList.add(string) ;
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objectList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span> &lt; <span style="color: #b58900; font-style: italic;">String</span> &gt;();
objectList.add(string) ;
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objectList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span> &lt; <span style="color: #b58900; font-style: italic;">Object</span> &gt;(); 
objectList.add(string) ;      
objectList.add(x) ;        
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">rawList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>();
rawList.add(string) ;    
rawList.add(x) ;       
</pre>
</div></li>
</ol>
</div>
</div>
