docs/inclass.org
* In class 8B
  :PROPERTIES:
  :CUSTOM_ID: ic8B
  :END:

  #+begin_src java
     // Chooser - a class badly in need of generics!
     // Bloch 3rd edition, Chapter 5, Item 28:  Prefer lists to arrays

     public class Chooser {
         private final Object[] choiceArray;

         public Chooser (Collection choices) {
             choiceArray = choices.toArray();
         }

         public Object choose() { 
             Random rnd = ThreadLocalRandom.current();
             return choiceArray [rnd.nextInt(choiceArray.length)];
         }
     }
  #+end_src

   

  - First, simply generify by adding a type to the Chooser class. What is the compiler error with this approach?
  - How can you turn the compiler error into a compiler warning?
  - Can this warning be suppressed? Should it?
  - How can you adopt Bloch's advice about arrays and lists to get a typesafe Chooser class without doing anything else that is complicated?
  - What would Liskov have to say about this class? How should it evolve to address her concerns? What is the appropriate place to deal with the problem? Does an invariant help? Is that a rep-invariant, or some other kind of invariant?

* In class 8C
  :PROPERTIES:
  :CUSTOM_ID: ic8C
  :END:
   
  #+begin_src java
     public class BoundedQueue {

         protected Object rep[];
         protected int front = 0;
         protected int back = -1;
         protected int size = 0;
         protected int count = 0;

         public BoundedQueue(int size) {
             if (size > 0) {
                 this.size = size;
                 rep = new Object[size];
                 back = size - 1;
             }  }

         public boolean isEmpty() { return (count == 0); }

         public boolean isFull() { return (count == size); }

         public int getCount() { return count; }

         public void put(Object e) {
             if (e != null && !isFull()) {
                 back++;
                 if (back >= size)
                     back = 0;
                 rep[back] = e;
                 count++;
             }  }

         public Object get() {
             Object result = null;
             if (!isEmpty()) {
                 result = rep[front];
                 rep[front] = null;
                 front++;
                 if (front >= size)
                     front = 0;
                 count--;
             }
             return result;
         }
     }

  #+end_src


  Generify!
  - Can you add a putAll() method? A getAll() method?
  - Recall that we used this same example in in-class 6 as a vehicle for applying Liskov's ideas to make code easier to understand.

