docs/inclass.html


<div id="outline-container-ic8B" class="outline-3">
<h3 id="ic8B">In class 8B</h3>
<div class="outline-text-3" id="text-ic8B">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Chooser - a class badly in need of generics!</span>
<span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Bloch 3rd edition, Chapter 5, Item 28:  Prefer lists to arrays</span>

<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Chooser</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">Object</span>[] <span style="color: #268bd2;">choiceArray</span>;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Chooser</span> (<span style="color: #b58900; font-style: italic;">Collection</span> <span style="color: #268bd2;">choices</span>) {
        choiceArray = choices.toArray();
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #b58900;">choose</span>() { 
        <span style="color: #b58900; font-style: italic;">Random</span> <span style="color: #268bd2;">rnd</span> = ThreadLocalRandom.current();
        <span style="color: #859900; font-weight: bold;">return</span> choiceArray [rnd.nextInt(choiceArray.length)];
    }
}
</pre>
</div>



<ul class="org-ul">
<li>First, simply generify by adding a type to the Chooser class. What is the compiler error with this approach?</li>
<li>How can you turn the compiler error into a compiler warning?</li>
<li>Can this warning be suppressed? Should it?</li>
<li>How can you adopt Bloch's advice about arrays and lists to get a typesafe Chooser class without doing anything else that is complicated?</li>
<li>What would Liskov have to say about this class? How should it evolve to address her concerns? What is the appropriate place to deal with the problem? Does an invariant help? Is that a rep-invariant, or some other kind of invariant?</li>
</ul>
</div>
</div>

<div id="outline-container-ic8C" class="outline-3">
<h3 id="ic8C">In class 8C</h3>
<div class="outline-text-3" id="text-ic8C">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">BoundedQueue</span> {

    <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">rep</span>[];
    <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">front</span> = 0;
    <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">back</span> = -1;
    <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span> = 0;
    <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">count</span> = 0;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">BoundedQueue</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (size &gt; 0) {
            <span style="color: #859900; font-weight: bold;">this</span>.size = size;
            rep = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Object</span>[size];
            back = size - 1;
        }  }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isEmpty</span>() { <span style="color: #859900; font-weight: bold;">return</span> (count == 0); }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isFull</span>() { <span style="color: #859900; font-weight: bold;">return</span> (count == size); }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">getCount</span>() { <span style="color: #859900; font-weight: bold;">return</span> count; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">put</span>(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">e</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (e != <span style="color: #6c71c4; font-weight: bold;">null</span> &amp;&amp; <span style="color: #268bd2; font-weight: bold;">!</span>isFull()) {
            back++;
            <span style="color: #859900; font-weight: bold;">if</span> (back &gt;= size)
                back = 0;
            rep[back] = e;
            count++;
        }  }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #b58900;">get</span>() {
        <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">result</span> = <span style="color: #6c71c4; font-weight: bold;">null</span>;
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>isEmpty()) {
            result = rep[front];
            rep[front] = <span style="color: #6c71c4; font-weight: bold;">null</span>;
            front++;
            <span style="color: #859900; font-weight: bold;">if</span> (front &gt;= size)
                front = 0;
            count--;
        }
        <span style="color: #859900; font-weight: bold;">return</span> result;
    }
}

</pre>
</div>


<p>
Generify!
</p>
<ul class="org-ul">
<li>Can you add a putAll() method? A getAll() method?</li>
<li>Recall that we used this same example in in-class 6 as a vehicle for applying Liskov's ideas to make code easier to understand.</li>
</ul>
</div>
</div>
