docs/inclass.html

<div id="outline-container-ic9A" class="outline-3">
<h3 id="ic9A">In class 9A</h3>
<div class="outline-text-3" id="text-ic9A">
<p>
Consider Bloch's <code>Point/ColorPoint</code> example. For today, ignore the <code>hashCode()</code> issue.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Point</span> {  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">routine code</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>; <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">y</span>;    
    ...
        <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> equals(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Standard recipe</span>
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> Point)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;

        <span style="color: #b58900; font-style: italic;">Point</span> <span style="color: #268bd2;">p</span> = (<span style="color: #b58900; font-style: italic;">Point</span>) obj;
        <span style="color: #859900; font-weight: bold;">return</span> p.x == x &amp;&amp; p.y == y;
    }
}

<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">ColorPoint</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Point</span> {  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">First attempt: Standard recipe</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">COLOR</span> <span style="color: #268bd2;">color</span>;
    ...
        <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> equals(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> ColorPoint)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;

        <span style="color: #b58900; font-style: italic;">ColorPoint</span> <span style="color: #268bd2;">cp</span> = (<span style="color: #b58900; font-style: italic;">ColorPoint</span>) obj;
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.equals(obj) &amp;&amp; cp.color == color;
    }
}

<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">ColorPoint</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Point</span> {  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Second attempt: DON'T DO THIS!</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">COLOR</span> <span style="color: #268bd2;">color</span>;
    ...
        <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> equals(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(o instance <span style="color: #b58900; font-style: italic;">of</span> <span style="color: #268bd2;">Point</span>)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;

        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">If obj is a normal Point, be colorblind</span>
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> ColorPoint)) <span style="color: #859900; font-weight: bold;">return</span> obj.equals(<span style="color: #859900; font-weight: bold;">this</span>);

        <span style="color: #b58900; font-style: italic;">ColorPoint</span> <span style="color: #268bd2;">cp</span> = (<span style="color: #b58900; font-style: italic;">ColorPoint</span>) obj;
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.equals(obj) &amp;&amp; cp.color == color;
    }
}
</pre>
</div>

<ol class="org-ol">
<li>What is the <code>equals()</code> contract? What is the standard recipe?</li>
<li>Why does Bloch use the <code>instanceof</code> operator in the standard recipe?</li>
<li>Write client code that shows a contract problem with the first attempt at <code>ColorPoint</code>.</li>
<li>Write client code that shows a contract problem with the second attempt at <code>ColorPoint</code>.</li>
<li>Some authors recommend solving this problem by using a different standard recipe for <code>equals()</code>.
<ul class="org-ul">
<li>What's the key difference?</li>
<li><p>
Which approach do you want in the following code:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">CounterPoint</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Point</span>
                                  <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> AtomicInteger counter =
                                  <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">AtomicInteger</span>();

<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">CounterPoint</span>(<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">x</span>, <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">y</span>) {
    <span style="color: #859900; font-weight: bold;">super</span> (x, y);
    counter.incrementAndGet();
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">numberCreated</span>() { <span style="color: #859900; font-weight: bold;">return</span> counter.get(); }

<span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) { ??? }
}


<span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Client code:</span>

<span style="color: #b58900; font-style: italic;">Point</span> <span style="color: #268bd2;">p</span> = PointFactory.getPoint();   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">either a Point or a CounterPoint</span>
<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">Point</span>&gt; <span style="color: #268bd2;">importantPoints</span> =   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">a set of important points</span>
    <span style="color: #b58900; font-style: italic;">boolean</span> b = PointUtilities.isImportant(p);  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">value?</span>

</pre>
</div></li>
</ul></li>
</ol>
</div>
</div>
