docs/inclass.html

<div id="outline-container-ic9B" class="outline-3">
<h3 id="ic9B">In class 9B</h3>
<div class="outline-text-3" id="text-ic9B">
<p>
Consider a variation of Liskov's <code>IntSet</code> example (Figure 5.10, page 97)
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">IntSet</span> <span style="color: #859900; font-weight: bold;">implements</span> <span style="color: #b58900; font-style: italic;">Cloneable</span> {  
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">els</span>;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">IntSet</span> () { els = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt;(); }
    ...
        <span style="color: #6c71c4; font-weight: bold;">@Override</span> 
        <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> equals(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) { 
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> IntSet)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;

        <span style="color: #b58900; font-style: italic;">IntSet</span> <span style="color: #268bd2;">s</span> = (<span style="color: #b58900; font-style: italic;">IntSet</span>) obj;
        <span style="color: #859900; font-weight: bold;">return</span> ???
            }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> 
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">hashCode</span>() { 
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">see below </span>
    }

    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">adding a private constructor</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900;">IntSet</span> (<span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">list</span>) { els = list; }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> 
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">IntSet</span> <span style="color: #b58900;">clone</span>() { 
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IntSet</span> ( <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt;(els));
    }

}
</pre>
</div>

<ol class="org-ol">
<li>How should the <code>equals()</code> method be completed?</li>
<li>Analyze the following ways to implement <code>hashCode()</code>? If there is a problem, give a test case that shows the problem.
<ol class="org-ol">
<li>not overridden at all</li>
<li>return 42;</li>
<li>return <code>els.hashCode()</code>;</li>
<li><code>int sum = 0; for (Integer i : els) sum += i.hashCode(); return sum;</code></li>
</ol></li>
<li>What's the problem with <code>clone()</code> here? Give a test case that shows the problem.</li>
<li>Fix <code>clone()</code> in two very different ways.</li>
</ol>
</div>
</div>
