docs/inclass.html

<div id="outline-container-ic10A" class="outline-3">
<h3 id="ic10A">In class 10A</h3>
<div class="outline-text-3" id="text-ic10A">
<p>
Consider Bloch's <code>InstrumentedHashSet</code>, <code>InstrumentedSet</code>, and <code>ForwardingSet</code> examples:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">InstrumentedHashSet</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">HashSet</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt;{
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">addCount</span> = 0;   
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">InstrumentedHashSet</span>() {}

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">add</span>(<span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">e</span>){ 
        addCount++; 
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.add(e); 
    }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">addAll</span>(<span style="color: #b58900; font-style: italic;">Collection</span>&lt;? <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">c</span>){ 
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">What to do with addCount?</span>
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.addAll(c); 
    }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">getAddCount</span>(){ <span style="color: #859900; font-weight: bold;">return</span> addCount; }
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">InstrumentedSet</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">ForwardingSet</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt;{
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">addCount</span> = 0;   

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">InstrumentedSet</span>(<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">s</span>){ <span style="color: #859900; font-weight: bold;">super</span>(s); }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">add</span>(<span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">e</span>){ addCount++; <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.add(e); }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">getAddCount</span>(){ <span style="color: #859900; font-weight: bold;">return</span> addCount; }
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">ForwardingSet</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #859900; font-weight: bold;">implements</span> <span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">s</span>;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">ForwardingSet</span>(<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">s</span>){ <span style="color: #859900; font-weight: bold;">this</span>.s = s; }
    <span style="color: #859900; font-weight: bold;">public</span>           <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">add</span>(<span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">e</span>)        { <span style="color: #859900; font-weight: bold;">return</span> s.add(e);     }
    <span style="color: #859900; font-weight: bold;">public</span>           <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">remove</span>(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">o</span>){ <span style="color: #859900; font-weight: bold;">return</span> s.remove(o);  }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span>(<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">o</span>){ <span style="color: #859900; font-weight: bold;">return</span> s.equals(o);  }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span>     <span style="color: #b58900;">hashCode</span>()      { <span style="color: #859900; font-weight: bold;">return</span> s.hashCode(); }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">String</span>  <span style="color: #b58900;">toString</span>()      { <span style="color: #859900; font-weight: bold;">return</span> s.toString(); }
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Other forwarded methods from Set interface omitted</span>
}

Consider also the following <span style="color: #b58900; font-style: italic;">client</span> <span style="color: #268bd2;">code</span>:

<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt; r = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">HashSet</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt;();
r.add(<span style="color: #2aa198;">"ant"</span>); r.add(<span style="color: #2aa198;">"bee"</span>);

<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt; <span style="color: #268bd2;">sh</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">InstrumentedHashSet</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt;();
sh.addAll(r);

<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt; <span style="color: #268bd2;">s</span> =  <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">InstrumentedSet</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt;(r);
s.add(<span style="color: #2aa198;">"ant"</span>); s.add(<span style="color: #2aa198;">"cat"</span>);

<span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt; <span style="color: #268bd2;">t</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">InstrumentedSet</span>&lt;<span style="color: #b58900; font-style: italic;">String</span>&gt;(s);
t.add(<span style="color: #2aa198;">"dog"</span>);

r.remove(<span style="color: #2aa198;">"bee"</span>);
s.remove(<span style="color: #2aa198;">"ant"</span>);
</pre>
</div>


<ol class="org-ol">
<li>How do you think the <code>addCount</code> variable should be updated in the <code>addAll()</code> method in <code>InstrumentedHashSet</code>?
<ol class="org-ol">
<li>Why is this a hard question?</li>
<li>What does the answer say about inheritance?</li>
<li>Does <code>equals()</code> behave correctly in <code>InstrumentedHashSet?</code></li>
</ol></li>
<li>Given your previous answer, what is the value of <code>sh.addCount</code> at the end of the computation?</li>
<li>Consider the <code>InstrumentedSet</code> solution. Besides being correct (always a plus!) why is it more general than the <code>InstrumentedHashSet</code> solution?</li>
<li>At the end of the computation, what are the values of: <code>r</code>, <code>s</code>, and <code>t</code>?</li>
<li>What would a call to <code>s.getAddCount()</code> return at the end of the computation?</li>
<li>At the end of the computation, what are the values of: <code>r.equals(s)</code>, <code>s.equals(t)</code>, and <code>t.equals(s)</code>?
<ul class="org-ul">
<li>Are there any problems with the <code>equals()</code> contract?</li>
</ul></li>
<li>Would this still work if you globally replaced sets with lists?</li>
<li>Would this still work if you globally replaced sets with collections?</li>
</ol>

<p>
<b>Note</b>: There is a lot going on in this example. I highly recommend that you play with the code until you understand it.    
</p>
</div>
</div>
