docs/inclass.html

<div id="outline-container-ic10B" class="outline-3">
<h3 id="ic10B">In class 10B</h3>
<div class="outline-text-3" id="text-ic10B">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Super</span> {
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Super</span>() {
        overrideMe();
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">overrideMe</span> () {
    }
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Sub</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Super</span> {

    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">Date</span> <span style="color: #268bd2;">date</span>;  <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">filled in by constructor</span>

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Sub</span>() {
        date = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Date</span>();
    }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">overrideMe</span> () {
        System.out.println(date);
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">main</span> (<span style="color: #b58900; font-style: italic;">String</span>[] <span style="color: #268bd2;">args</span>) {
        <span style="color: #b58900; font-style: italic;">Sub</span> <span style="color: #268bd2;">sub</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Sub</span>();
        sub.overrideMe();
    }
}
</pre>
</div>

<ol class="org-ol">
<li>What is the pattern, and how common is it?</li>
<li>What does the main method do, and why?</li>
<li>Which of Bloch's rules does this example break?</li>
<li>What does this example mean for <code>Cloneable</code> interface and the <code>clone()</code> method?</li>
<li>What does this example mean for <code>Serializable</code> interface and the <code>readObject()</code> method?</li>
<li>To what extent does this rule generalize to producer methods?</li>
</ol>
</div>
</div>

<div id="outline-container-ic10C" class="outline-3">
<h3 id="ic10C">In class 10C</h3>
<div class="outline-text-3" id="text-ic10C">
<p>
Consider a mutable complex number class:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">MComplex</span> {
    <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">re</span>; <span style="color: #859900; font-weight: bold;">protected</span> <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">im</span>;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">MComplex</span> (<span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">re</span>, <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">im</span>) { <span style="color: #859900; font-weight: bold;">this</span>.re = re; <span style="color: #859900; font-weight: bold;">this</span>.im = im; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #b58900;">getReal</span>()      { <span style="color: #859900; font-weight: bold;">return</span> re; }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #b58900;">getImaginary</span>() { <span style="color: #859900; font-weight: bold;">return</span> im; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">setReal</span>(<span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">re</span>)      { <span style="color: #859900; font-weight: bold;">this</span>.re = re; }
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">setImaginary</span>(<span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">im</span>) { <span style="color: #859900; font-weight: bold;">this</span>.im = im; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">add</span> (<span style="color: #b58900; font-style: italic;">MComplex</span> <span style="color: #268bd2;">c</span>) { re += c.re; im += c.im; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">subtract</span> (<span style="color: #b58900; font-style: italic;">MComplex</span> <span style="color: #268bd2;">c</span>) { re -= c.re; im -= c.im; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">multiply</span> (<span style="color: #b58900; font-style: italic;">MComplex</span> <span style="color: #268bd2;">c</span>) {
        <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">r</span> = re * c.re - im * c.im;
        <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">i</span> = re * c.im + im * c.re;
        re = r; im = i;
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">divide</span> (<span style="color: #b58900; font-style: italic;">MComplex</span> <span style="color: #268bd2;">c</span>) {
        <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">den</span> = c.re * c.re + c.im * c.im;
        <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">r</span> = (re * c.re - im * c.im) / den;
        <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">i</span> = (re * c.im + im * c.re) / den;
        re = r; im = i;
    }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">o</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (o == <span style="color: #859900; font-weight: bold;">this</span>)               <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">true</span>;
        <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(o <span style="color: #859900; font-weight: bold;">instanceof</span> MComplex)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;
        <span style="color: #b58900; font-style: italic;">MComplex</span> <span style="color: #268bd2;">c</span> = (<span style="color: #b58900; font-style: italic;">MComplex</span>) o;

        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">See Bloch page 43 to find out why to use compare() instead of ==</span>
        <span style="color: #859900; font-weight: bold;">return</span> Double.compare(re, c.re) == 0 &amp;&amp;
            Double.compare(im, c.im) == 0;
    }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">hashCode</span> () {
        <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">result</span> = 17 + hashDouble(re);
        result = 31 * result + hashDouble(im);
        <span style="color: #859900; font-weight: bold;">return</span> result;
    }

    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">hashDouble</span> (<span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">val</span>) {
        <span style="color: #b58900; font-style: italic;">long</span> <span style="color: #268bd2;">longBits</span> = Double.doubleToLongBits(val);
        <span style="color: #859900; font-weight: bold;">return</span> (<span style="color: #b58900; font-style: italic;">int</span>) (longBits ^ (longBits &gt;&gt;&gt;32));
    }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #b58900;">toString</span>() { <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">"("</span> + re + <span style="color: #2aa198;">" + "</span> + im + <span style="color: #2aa198;">"i)"</span>; }
}

</pre>
</div>

<p>
Before we get to immutability, consider the method contracts. Where do the various contracts "come from", and is there anything in the (missing) JavaDoc that might require a bit of research?
</p>

<p>
Apply each of Bloch's 5 rules for making a class immutable:
</p>
<ol class="org-ol">
<li>Don't provide any methods that modify the object's state. How do you handle the mutators?</li>
<li>Ensure that no methods can be overridden.
<ul class="org-ul">
<li>Why is this a problem? Show me!</li>
<li>Fix the problem:
<ul class="org-ul">
<li>Change the class declaration, or</li>
<li>Change the method declarations, or</li>
<li>Change the constructor visibility.</li>
</ul></li>
</ul></li>
<li>Make all fields final.</li>
<li>Make all fields private.
<ul class="org-ul">
<li>Is there a significant difference in visibility between re and im?</li>
</ul></li>
<li>Ensure exclusive access to any mutable components.</li>
</ol>
</div>
</div>
