docs/inclass.org
* In class 11
  :PROPERTIES:
  :CUSTOM_ID: ic11
  :END:

  This is a JUnit theory exercise.

  1. Write a JUnit theory that captures the symmetry property of the =equals()= method.
  1. Create =@DataPoints= from Bloch's =Point=, =ColorPoint= classes. So that we're all on the same page, create 1 =null= reference, 1 =Point= object and 2 =ColorPoint= objects.
  1. Given this set of data points:
     - How many combinations are considered by the theory?
     - How many combinations make it past the preconditions of the theory?
     - How many combinations make it to the postcondition of the theory? 
  1. What happens to this theory and the accompanying data points when favoring composition over inheritance?
  1. Repeat the exercise for the transitive property for =equals()=.
  1. Recall the =equals()= and =hashCode()= discussion in Bloch. Write a JUnit theory that encodes the consistency property between =equals()= and =hashCode()=.
  1. Build a toy example that violates the theory. Fix the toy example so that the theory is no longer violated.
  1. Consider the =Comparable= interface: what properties should be checked with theories? 

* In class 12A
  :PROPERTIES:
  :CUSTOM_ID: ic12A
  :END:

  Consider the following (bad) Java, implementing the "C style" enum pattern:

  #+begin_src java
     public class Coins {
         public static final int PENNY = 1;
         public static final int NICKLE = 5;
         public static final int DIME = 10;
         public static final int QUARTER = 25;
     }

  #+end_src

  1. Give example code that illustrates a type safety problem with =Coins=. Work through a range of expressions from "probably ok" to "clearly wrong".
  1. What code would you need to turn a nickel into a string? Explain how this could go wrong at runtime.
  1. What code would you need to iterate through the coins?
  1. Would extensions to this particular enum be likely to require recompilation of client code? Explain.
  1. Write a decent Java Enum for coins.
  1. Turn a nickle into a string.
  1. Iterate though the coins.


  Consider Bloch's example:

  #+begin_src java
     // Abuse of ordinal to derive an associated value – DON’T DO THIS
     public enum Ensemble {
         SOLO,   DUET,   TRIO,  QUARTET, QUINTET, 
         SEXTET, SEPTET, OCTET, NONET,   DECTET;

         public int numberOfMusicians() { return ordinal() + 1; }
     }
  #+end_src

  Explain why it's wrong, fix it, and add another enum with an overlapping number of musicians.

* In class 12B
  :PROPERTIES:
  :CUSTOM_ID: ic12B
  :END:

  This is a recap exercise based on the map-based implementation of Liskov's polynomial example: [[./files/MapPoly.java][MapPoly]]

  1. How are the following polynomials represented?
     - $0$
     - $3-7x^4$
  1. Bloch would not accept that the MapPoly class is immutable. Why not? Show how it would be possible to provide mutable behavior with the class if Bloch's problem isn't fixed. Fix the problem, and implement any other changes Bloch suggests, even if they don't compromise immutability in this particular example.
  1. Write a reasonable rep-invariant for =MapPoly=. How would this rep-invariant change if the zero =Poly= had an alternate representation.
  1. Provide reasonable implementations of =equals()= and =hashCode()=. Explain why you believe your implemetations are appropriate.
  1. As written, the contract for the =coeff()= method is inconsistent with other contracts in the class.
     - What is the inconsistency with the contract?
     - Fix the inconsistency with the contract.
     - Fix the code to match the revised contract. 
  1. Argue that the implementation of the =coeff()= method is correct (with respect to your repaired contract, of course.)
  1. Consider implementing =Cloneable= for this class. Decide whether Bloch would think this is a good idea and provide justification for your answer. Note: You don't have to actually implement anything for this question.
  1. See if you can come up with a theory about Polys and implement it in JUnit. (Polys are math objects, so there should be theories!) Here's a suggestion: Think about the relationship between the degrees of two Polys being multiplied and the resulting degree.

