docs/inclass.html

<div id="outline-container-ic11" class="outline-3">
<h3 id="ic11">In class 11</h3>
<div class="outline-text-3" id="text-ic11">
<p>
This is a JUnit theory exercise.
</p>

<ol class="org-ol">
<li>Write a JUnit theory that captures the symmetry property of the <code>equals()</code> method.</li>
<li>Create <code>@DataPoints</code> from Bloch's <code>Point</code>, <code>ColorPoint</code> classes. So that we're all on the same page, create 1 <code>null</code> reference, 1 <code>Point</code> object and 2 <code>ColorPoint</code> objects.</li>
<li>Given this set of data points:
<ul class="org-ul">
<li>How many combinations are considered by the theory?</li>
<li>How many combinations make it past the preconditions of the theory?</li>
<li>How many combinations make it to the postcondition of the theory?</li>
</ul></li>
<li>What happens to this theory and the accompanying data points when favoring composition over inheritance?</li>
<li>Repeat the exercise for the transitive property for <code>equals()</code>.</li>
<li>Recall the <code>equals()</code> and <code>hashCode()</code> discussion in Bloch. Write a JUnit theory that encodes the consistency property between <code>equals()</code> and <code>hashCode()</code>.</li>
<li>Build a toy example that violates the theory. Fix the toy example so that the theory is no longer violated.</li>
<li>Consider the <code>Comparable</code> interface: what properties should be checked with theories?</li>
</ol>
</div>
</div>

<div id="outline-container-ic12A" class="outline-3">
<h3 id="ic12A">In class 12A</h3>
<div class="outline-text-3" id="text-ic12A">
<p>
Consider the following (bad) Java, implementing the "C style" enum pattern:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Coins</span> {
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">PENNY</span> = 1;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">NICKLE</span> = 5;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">DIME</span> = 10;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">QUARTER</span> = 25;
}

</pre>
</div>

<ol class="org-ol">
<li>Give example code that illustrates a type safety problem with <code>Coins</code>. Work through a range of expressions from "probably ok" to "clearly wrong".</li>
<li>What code would you need to turn a nickel into a string? Explain how this could go wrong at runtime.</li>
<li>What code would you need to iterate through the coins?</li>
<li>Would extensions to this particular enum be likely to require recompilation of client code? Explain.</li>
<li>Write a decent Java Enum for coins.</li>
<li>Turn a nickle into a string.</li>
<li>Iterate though the coins.</li>
</ol>


<p>
Consider Bloch's example:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Abuse of ordinal to derive an associated value &#8211; DON&#8217;T DO THIS</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900; font-style: italic;">Ensemble</span> {
    <span style="color: #268bd2;">SOLO</span>,   <span style="color: #268bd2;">DUET</span>,   <span style="color: #268bd2;">TRIO</span>,  <span style="color: #268bd2;">QUARTET</span>, <span style="color: #268bd2;">QUINTET</span>, 
    <span style="color: #268bd2;">SEXTET</span>, <span style="color: #268bd2;">SEPTET</span>, <span style="color: #268bd2;">OCTET</span>, <span style="color: #268bd2;">NONET</span>,   <span style="color: #268bd2;">DECTET</span>;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #b58900;">numberOfMusicians</span>() { <span style="color: #859900; font-weight: bold;">return</span> ordinal() + 1; }
}
</pre>
</div>

<p>
Explain why it's wrong, fix it, and add another enum with an overlapping number of musicians.
</p>
</div>
</div>

<div id="outline-container-ic12B" class="outline-3">
<h3 id="ic12B">In class 12B</h3>
<div class="outline-text-3" id="text-ic12B">
<p>
This is a recap exercise based on the map-based implementation of Liskov's polynomial example: <a href="./files/MapPoly.java">MapPoly</a>
</p>

<ol class="org-ol">
<li>How are the following polynomials represented?
<ul class="org-ul">
<li>\(0\)</li>
<li>\(3-7x^4\)</li>
</ul></li>
<li>Bloch would not accept that the MapPoly class is immutable. Why not? Show how it would be possible to provide mutable behavior with the class if Bloch's problem isn't fixed. Fix the problem, and implement any other changes Bloch suggests, even if they don't compromise immutability in this particular example.</li>
<li>Write a reasonable rep-invariant for <code>MapPoly</code>. How would this rep-invariant change if the zero <code>Poly</code> had an alternate representation.</li>
<li>Provide reasonable implementations of <code>equals()</code> and <code>hashCode()</code>. Explain why you believe your implemetations are appropriate.</li>
<li>As written, the contract for the <code>coeff()</code> method is inconsistent with other contracts in the class.
<ul class="org-ul">
<li>What is the inconsistency with the contract?</li>
<li>Fix the inconsistency with the contract.</li>
<li>Fix the code to match the revised contract.</li>
</ul></li>
<li>Argue that the implementation of the <code>coeff()</code> method is correct (with respect to your repaired contract, of course.)</li>
<li>Consider implementing <code>Cloneable</code> for this class. Decide whether Bloch would think this is a good idea and provide justification for your answer. Note: You don't have to actually implement anything for this question.</li>
<li>See if you can come up with a theory about Polys and implement it in JUnit. (Polys are math objects, so there should be theories!) Here's a suggestion: Think about the relationship between the degrees of two Polys being multiplied and the resulting degree.</li>
</ol>
</div>
</div>
