docs/inclass.html

<div id="outline-container-ic13" class="outline-3">
<h3 id="ic13">In class 13</h3>
<div class="outline-text-3" id="text-ic13">
<p>
How well are you prepared for the final? This exercise should help you find out. Piazza discussions encouraged!
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Stack</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Object</span>[] <span style="color: #268bd2;">elements</span>; <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span> = 0;

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Stack</span>() { <span style="color: #859900; font-weight: bold;">this</span>.elements = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">Object</span>[0]; }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">push</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">e</span>) {
        <span style="color: #859900; font-weight: bold;">if</span> (e == <span style="color: #6c71c4; font-weight: bold;">null</span>) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">NullPointerException</span>(<span style="color: #2aa198;">"Stack.push"</span>);
        ensureCapacity(); elements[size++] = e;  
    }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">pushAll</span> (<span style="color: #b58900; font-style: italic;">Object</span>[] <span style="color: #268bd2;">collection</span>) { <span style="color: #859900; font-weight: bold;">for</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>: collection) { push(obj); } }

    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #b58900;">pop</span> () {
        <span style="color: #859900; font-weight: bold;">if</span> (size == 0) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IllegalStateException</span>(<span style="color: #2aa198;">"Stack.pop"</span>);
        <span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">result</span> = elements[--size];
        <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">elements[size] = null;</span>
        <span style="color: #859900; font-weight: bold;">return</span> result;
    }

    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #b58900;">toString</span>() {
        <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">result</span> = <span style="color: #2aa198;">"size = "</span> + size;
        result += <span style="color: #2aa198;">"; elements = ["</span>;
        <span style="color: #859900; font-weight: bold;">for</span> (<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">i</span> = 0; i &lt; elements.<span style="color: #b58900; font-style: italic;">length</span>; i++) {
            <span style="color: #859900; font-weight: bold;">if</span> (i &lt; elements.<span style="color: #b58900; font-style: italic;">length</span>-1)
                result = result + elements[i] + <span style="color: #2aa198;">", "</span>;
            <span style="color: #859900; font-weight: bold;">else</span>
                result = result + elements[i];
        }
        <span style="color: #859900; font-weight: bold;">return</span> result + <span style="color: #2aa198;">"]"</span>;
    }
}


</pre>
</div>

<ol class="org-ol">
<li>Write a contract for <code>push(Object e)</code>.</li>
<li>What is wrong with <code>toString()?</code> Fix it.</li>
<li>What rep-invariant is likely broken? Fix it. This includes writing a suitable rep-invariant.</li>
<li>How would Bloch's Item 25: <i>Prefer Lists to Arrays</i> apply here? Would it make the rep-invariant simpler?</li>
<li>How would you argue that that <code>pop()</code> is correct (or not)?</li>
<li>As <code>Stack</code> is written, <code>pushAll()</code> requires special documention? Why? What would Bloch suggest as an alternative?</li>
<li>Override <code>equals()</code>. What else do you have to do? Do that too.</li>
<li>Generify. What should happen to the parameter for <code>pushAll()</code>? Why?</li>
<li>Suppose we decide to implement the <code>Cloneable()</code> interface. In what ways would Bloch think we would likely get it wrong? What would Bloch recommend instead?</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org5775edf" class="outline-2">
<h2 id="org5775edf">Links</h2>
<div class="outline-text-2" id="text-org5775edf">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
